allison/app/controllers/chat_controller.rb

	def index
	  @user = User.create.id
	  @count = User.all.size
	  puts "Creating User #{@user}"
          # get ip
          @ip = request.remote_ip
          UserRecord.create(:user_id => @user, :ip=>@ip)
---
INSERT INTO `users` (`email`, `current_sign_in_ip`, `last_sign_in_at`, `current_sign_in_at`, `reset_password_sent_at`, `sign_in_count`, `updated_at`, `reset_password_token`, `admin`, `created_at`, `encrypted_password`, `remember_created_at`, `last_sign_in_ip`) VALUES ('', NULL, NULL, NULL, NULL, 0, '2011-12-20 00:05:18', NULL, NULL, '2011-12-20 00:05:18', '', NULL, NULL)
SELECT `users`.* FROM `users`
INSERT INTO `records` (`user2`, `role2`, `channel`, `updated_at`, `role1`, `created_at`, `recordfile`, `user1`) VALUES (26, 'Jesus', 13, '2011-11-28 07:34:36', 'Richard Dawkins', '2011-11-28 07:34:36', 13, 25)

	def find_location_by_user_id(user_id)
	    @user_id = user_id
	    @ip = UserRecord.find_by_user_id(@user_id).ip
---
SELECT `user_records`.* FROM `user_records` WHERE (`user_records`.`user_id` IS NULL) LIMIT 1